org/2021/meditation-210526.org
#+SETUPFILE: ~/repo/blog/tpl/nil-site-tpl.org
#+TITLE: 沉思录210526

每日自问：

1. 你想成为怎样的人？

面试题的背后藏着的问题是什么？

你的兴趣？

- 面试官真正关心的，是你对一个问题的思考，不仅仅是问题本身。

- 询问对方最熟悉的领域，面试官通过对方对该领域的了解程度，来判断简历当中信息的可信度

你最拿手的是什么技术？

跟我描述一下你的大学校园的布局？

- 考察能否向一个事先不了解这件事情的人，描述清楚一件事物的能力

上海有多少辆出租车？

@王建硕 [[https://mp.weixin.qq.com/s/ge34AxyKuhBGfUqkZ3dYmw]]

--------------

随机波动/中二所

科研与性别的关系

女性：从处于弱势的角度，来创造性地看待自己的处境。

--------------

宿舍门前的白花好像是蔷薇（其中一个品种：白玉堂）。

--------------

计算机编程语言的本质------逻辑，学会一门编程语言需要不超过 9k 小时的时间

--------------

想法+机会=成功

--------------

学习就是找到自己的需求与社会需求的契合点。

--------------

就业是我的一种选择，我选择在什么样的公司工作

--------------

一个公司=一个系统框架+各个专业的人

--------------

知识本身并不能带给我什么，重要的是知识带给我们的启发。关于社会生活的启示。

--------------

让电子笔记在大脑中留下痕迹

--------------

搭建好一个框架，嵌入子系统

--------------

说错比不说强

--------------

与人交流要有意义、有价值，如果没有，这样的谈话就不值得花时间。

--------------

把握生活的细节，体会细节里的系统概念。

--------------

信号与信息

信号：特定意义的表达（表达的是信号类型），例如，电、振动

信息：确定表达的意义（表达的是信号），这是一种人为的定义。例子，有人从远处走来，通过传来的脚步声（脚步声是信号），确定对方的身份。（「确定对方身份」这一结果是信息）

分清「信号」和「信息」，并学会自我定义。

--------------

说脏话，一开始是主动地说，经过多次重复，会在下意识时说出来。

要想永远不说脏话，就要对说脏话本身感到羞耻。利用羞耻心使我不说脏话。

由此及彼，对于知识性内容，也可以通过主动地重复，以达到下意识能够说出的地步。

--------------

今日完成：

1. 理解 React 章节，Flux 的核心思想之前的部分。
2. 完成 fCC ES6 的前 10 个任务
3. 把单片机中的有关串口通信的重要知识点记录到语雀知识库中
4. 把科技论文写作基础记录在 blog 中
