blog/2021/meditation-210526.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 16:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>沉思录 210526</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">沉思录 210526</h1>
</header><p>
每日自问：
</p>

<ol class="org-ol">
<li>你想成为怎样的人？</li>
</ol>

<p>
面试题的背后藏着的问题是什么？
</p>

<p>
你的兴趣？
</p>

<ul class="org-ul">
<li>面试官真正关心的，是你对一个问题的思考，不仅仅是问题本身。</li>

<li>询问对方最熟悉的领域，面试官通过对方对该领域的了解程度，来判断简历当中信息的可信度</li>
</ul>

<p>
你最拿手的是什么技术？
</p>

<p>
跟我描述一下你的大学校园的布局？
</p>

<ul class="org-ul">
<li>考察能否向一个事先不了解这件事情的人，描述清楚一件事物的能力</li>
</ul>

<p>
上海有多少辆出租车？
</p>

<p>
@王建硕 <a href="https://mp.weixin.qq.com/s/ge34AxyKuhBGfUqkZ3dYmw">https://mp.weixin.qq.com/s/ge34AxyKuhBGfUqkZ3dYmw</a>
</p>

<hr>

<p>
随机波动/中二所
</p>

<p>
科研与性别的关系
</p>

<p>
女性：从处于弱势的角度，来创造性地看待自己的处境。
</p>

<hr>

<p>
宿舍门前的白花好像是蔷薇（其中一个品种：白玉堂）。
</p>

<hr>

<p>
计算机编程语言的本质-&#x2013;&#x2014;逻辑，学会一门编程语言需要不超过 9k 小时的时间
</p>

<hr>

<p>
想法+机会=成功
</p>

<hr>

<p>
学习就是找到自己的需求与社会需求的契合点。
</p>

<hr>

<p>
就业是我的一种选择，我选择在什么样的公司工作
</p>

<hr>

<p>
一个公司=一个系统框架+各个专业的人
</p>

<hr>

<p>
知识本身并不能带给我什么，重要的是知识带给我们的启发。关于社会生活的启示。
</p>

<hr>

<p>
让电子笔记在大脑中留下痕迹
</p>

<hr>

<p>
搭建好一个框架，嵌入子系统
</p>

<hr>

<p>
说错比不说强
</p>

<hr>

<p>
与人交流要有意义、有价值，如果没有，这样的谈话就不值得花时间。
</p>

<hr>

<p>
把握生活的细节，体会细节里的系统概念。
</p>

<hr>

<p>
信号与信息
</p>

<p>
信号：特定意义的表达（表达的是信号类型），例如，电、振动
</p>

<p>
信息：确定表达的意义（表达的是信号），这是一种人为的定义。例子，有人从远处走来，通过传来的脚步声（脚步声是信号），确定对方的身份。（「确定对方身份」这一结果是信息）
</p>

<p>
分清「信号」和「信息」，并学会自我定义。
</p>

<hr>

<p>
说脏话，一开始是主动地说，经过多次重复，会在下意识时说出来。
</p>

<p>
要想永远不说脏话，就要对说脏话本身感到羞耻。利用羞耻心使我不说脏话。
</p>

<p>
由此及彼，对于知识性内容，也可以通过主动地重复，以达到下意识能够说出的地步。
</p>

<hr>

<p>
今日完成：
</p>

<ol class="org-ol">
<li>理解 React 章节，Flux 的核心思想之前的部分。</li>
<li>完成 fCC ES6 的前 10 个任务</li>
<li>把单片机中的有关串口通信的重要知识点记录到语雀知识库中</li>
<li>把科技论文写作基础记录在 blog 中</li>
</ol>
</div>
</body>
</html>